# Git - это такая система контроля версий.
# Т.е. есть какая-то папка и мы в ней проводим какие-то изменения.
# Git будет отслеживать все изменения в этой папке папке, можно будет вернуться к более старым версиям измененений.

# Не стоит путать Git и GitHub
# Git - это сама система контроля версий (управление каким-то ресурсом, какой-то папки, которые мы к ней подключим),
# GitHub - это репозиторий, как место хранилище кода. Облачное хранилище, которое управляется командами Git и туда можно все класть.

# Создать Git repository - это означает, что под каждую папку, если мы создаем Git repository мы его создаем на своем компьютере.

# Этот инструмент нужен для того, чтобы сохранять свое виденье, когда работаем в коллективе и каждый человек отправляет свой документ
# на GitHub и все в курсе вносимых изменений.